name_of_explorer = input("Введите ФИО исследователя: ")
data = input("Введите дату: ")
name_of_experiment = input("Введите название эксперимента: ")
conclusion = input("Введите вывод: ")

with open("/Users/macbook/Desktop/Горохова_АИ/journal.txt", "w", encoding="utf-8") as journal:
    journal.write(f"+------------------------------------------------------------------------------------------------------------+\n~\tЭлектронный лабораторный журнал\t~\n")
    journal.write(f"+------------------------------------------------------------------------------------------------------------+\n~\tФИО исследователя:\t{name_of_explorer}\t~\n")
    journal.write(f"~\tДата:\t{data}\t~\n~\tЭксперимент:\t{name_of_experiment}\t~\n+------------------------------------------------------------------------------------------------------------+\n")
    journal.write(f"~\tВывод:\t{conclusion}~\n+------------------------------------------------------------------------------------------------------------+")

print("Данные успешно сохранены.")